In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
# by using pd.Index instead of param index=, pd.Index will allow you to name the indexes at the same time
dframe1 = DataFrame(
    np.arange(8).reshape(2,4),
    index   = pd.Index(['LA','SF'],name='city'),
    columns = pd.Index(['A','B','C','D'], name = 'letter')
)

dframe1

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [3]:
# Return a reshaped DataFrame or Series having a multi-level index with one or more new inner-most levels compared to the current DataFrame
dframe_st = dframe1.stack()
dframe_st

city  letter
LA    A         0
      B         1
      C         2
      D         3
SF    A         4
      B         5
      C         6
      D         7
dtype: int32

In [5]:
# turn it back into a dataframe and undo what we did above
dframe_st.unstack()

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [7]:
# unstack by the level/index name
# notice the city is now columns and letter are indexes
dframe_st.unstack('city')

city    LA  SF
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [9]:
# handling null values 
ser1 = Series([0,1,2], index = ['Q','X','Y'])

ser2 = Series([4,5,6], index = ['X','Y','Z'])

In [11]:
# concat
# notice it is not a dataframe return. returned is a muti-series concated
dframe = pd.concat([ser1,ser2],keys = ['Alpha', 'Beta'])
dframe

Alpha  Q    0
       X    1
       Y    2
Beta   X    4
       Y    5
       Z    6
dtype: int64

In [12]:
# to turn the above into a dataframe
# notice null values returned when either series does not have the key index in their table
dframe.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [15]:
# if we dont want the null values then keep the series stack and keep it as a multi levels Series 
dframe.unstack().stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [25]:
# in event where you want a stack multi Series with the null values
# dframe = dframe.unstack()
# dframe.stack()
dframe.stack(dropna=False)

Q  Alpha    0.0
   Beta     NaN
X  Alpha    1.0
   Beta     4.0
Y  Alpha    2.0
   Beta     5.0
Z  Alpha    NaN
   Beta     6.0
dtype: float64